config/Documents/ЗаписьНаПрием.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ЗаписьНаПрием</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЗаписиНаПрием</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДКонтрагента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВремяЗаписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мастер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мастера</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураМастеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВремяЗаписи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗаписиНаПрием</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыЗаписейНаПрием</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/InformationRegisters/ЗаписиНаПрием.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ЗаписиНаПрием</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЗаписиНаПрием</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаписейНаПрием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мастера</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номекнлатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураМастеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/Enums/ТипыЗаписейНаПрием.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ТипыЗаписейНаПрием</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телеграм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Звонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Онлайн</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/Documents/ЗаписьНаПрием/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЗаписиНаПрием
	Если ВремяЗаписи.Количество() = 0 Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Движения.ЗаписиНаПрием.Записывать = Истина;
	Для Каждого ТекСтрокаВремяЗаписи Из ВремяЗаписи Цикл
		Движение = Движения.ЗаписиНаПрием.Добавить();
		Движение.Мастер = ТекСтрокаВремяЗаписи.Мастер;
		Движение.Контрагент = Контрагент;
		Движение.Номекнлатура = ТекСтрокаВремяЗаписи.Номенклатура;
		Движение.ДатаВремяЗаписи = ТекСтрокаВремяЗаписи.ДатаВремяЗаписи;
		//Движение.ВремяЗаписи = ТекСтрокаВремяЗаписи.ВремяЗаписи;
		Движение.ТипЗаписиНаПрием = ТекСтрокаВремяЗаписи.ТипЗаписиНаПрием;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;		
	
	стрКонтрагент = Боты.НайтиКлиентаПоИДТелеграм(ДанныеЗаполнения);
	
	Если НЕ стрКонтрагент.Существует Тогда
		Возврат;
	КонецЕсли;
	
	Дата = ТекущаяДата();
	ИДКонтрагента = ДанныеЗаполнения;
	Контрагент = стрКонтрагент.Контрагент;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//
// Процедура ДобавитьКоличество
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ДобавитьНоменклатуру(Мастер, Номенклатура) Экспорт
	
	// Ищем выбранную позицию в таблице подобранной номенклатуры.
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("Мастер", Мастер);
	СтруктураОтбора.Вставить("Номенклатура", Номенклатура);
	СтрокаТабличнойЧасти = ОбработкаТабличныхЧастей.НайтиСтрокуТабЧасти(ВремяЗаписи, СтруктураОтбора);
	Если СтрокаТабличнойЧасти <> Неопределено Тогда
		// уже есть, ничего не делаем
	Иначе
		// Не нашли - добавляем новую строку.
		СтрокаТабличнойЧасти = ВремяЗаписи.Добавить();
		СтрокаТабличнойЧасти.Мастер = Мастер;
		СтрокаТабличнойЧасти.Номенклатура = Номенклатура;
		//СтрокаТабличнойЧасти.ВремяС = ВремяС;
		СтрокаТабличнойЧасти.ТипЗаписиНаПрием   = Перечисления.ТипыЗаписейНаПрием.Телеграм;
	КонецЕсли;
	
	//ИзмКоличество(СтрокаТабличнойЧасти);
	
КонецПроцедуры //ДобавитьКоличество

Процедура ЗаписатьВремя(Мастер, ЗаписьНаДату) Экспорт
	
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("Мастер", Мастер);
	//СтруктураОтбора.Вставить("Номенклатура", Справочники.НоменклатураМастеров.ПустаяСсылка());
	строкиТабЧасти = ВремяЗаписи.НайтиСтроки(СтруктураОтбора);
	
	Если строкиТабЧасти.Количество() > 0 Тогда
		Для каждого строкаТЧ Из строкиТабЧасти Цикл
			строкаТЧ.ДатаВремяЗаписи = ЗаписьНаДату;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

//Процедура ИзмКоличество(стрТовары) Экспорт
//	
//	Цена = МодульТелеграмСлужебный.ПолучитьЦену(Дата, стрТовары.Номенклатура, ТипЦен);
//	
//	стрТовары.Цена = Цена;
//	стрТовары.Сумма = стрТовары.Количество*стрТовары.Цена*стрТовары.Коэффициент;
//	
//КонецПроцедуры
